src/cf/InformationRegisters/GDS_ФайлыАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ФайлыАПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвоичныеДанныеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_ФайлыАПП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записать данные предпросмотра.
// 
// Параметры:
//  Файл -  СправочникССылка.Файлы
//  HTMLПредставление - Строка
//  ВерсияФайла - СправочникСсылка.ВерсииФайлов
//  ПредпросмотрУрезан  - Булево
Процедура ДобавитьЗапись(Идентификатор, Файлы) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
	
	Для Каждого Стр Из Файлы Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Идентификатор       = Идентификатор;
		НоваяЗапись.ИдентификаторФайла  = Стр.ИдентификаторФайла;
		НоваяЗапись.ДатаФайла           = ТекущаяДатаСеанса();
		
		НоваяЗапись.Имя                 = Стр.Имя;
		НоваяЗапись.Размер              = Стр.Размер;
		НоваяЗапись.Расширение          = Стр.Расширение;
		НоваяЗапись.ДвоичныеДанныеФайла = Новый ХранилищеЗначения(Стр.ДвоичныеДанныеФайла, Новый СжатиеДанных);
		
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры

// Очищает HTML представление файла
// 
// Параметры:
//  Файл - СправочникССылка.Файлы
Процедура Удалить(Идентификатор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
	
	НаборЗаписей.Записать(); // удалим все по отбору
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
